test=prueba

role.id_required=El ID del rol es necesario para obtener informaci\u00f3n y este debe ser mayor a 0.
role.not_found=El rol con ID %d no se encuentra.
role.is_null=Es requerida la informaci\u00f3n del rol.
role.name=El nombre del rol es requerido.
role.n_exists=El nombre de este rol ya existe, especificar otro.
role.permissions=Para agregar un rol necesitas por lo menos especificar un permiso.
role.functionality=Todos los permisos necesitan de una funcionalidad y un tipo.

user.id_required=El ID del usuario es importante para obtener informaci\u00f3n y este debe ser mayor a 0.
user.not_found=El usuario con ID %d no existe.
user.size=El parametro 'size' debe ser mayor a 0.
user.type=El tipo de usuario es requerido.
user.is_null=La informaci\u00f3n de usuario es requerida.
user.email=El correo electr\u00f3nico es requerido.
user.e_format=El correo electr\u00f3nico debe tener el siguiente formato: ejemplo@servidor.com
user.e_exists=El usuario con correo electr\u00f3nico %s ya existe.
user.username=El nombre de usuario acepta caracteres alfanumericos y el caracter '_' pero no solamente numeros, tambi\u00e9n este debe tener de 3 a 12 caracteres.
user.u_exists=El nombre de usuario %s ya existe.
user.passw=La contrase\u00f1a del usuario es requerida y esta debe tener minimo 6 caracteres.
user.dname=El nombre de la persona es requerida.
user.operation=La operaci\u00f3n en la que se encuentra la persona es requerida.
user.role=Si el usuario es OPERADOR, entonces se debe especificar un rol.
user.nsuper=No se puede crear un SUPER USUARIO.
user.modify=La informaci\u00f3n del usuario es requerida para ser modificado.
user.login.username=El nombre de usuario o correo electr\u00f3nico es requerido para iniciar sesi\u00f3n.
user.login.passw=La contrase\u00f1a es requerida.
user.delete=Los usuarios administrador no se pueden eliminar por este medio, se necesita eliminar la operaci\u00f3n que los creo.

person.id_required=El id de la persona es requerido y debe ser mayor a cero.
person.not_found=La persona con id %d no fue encontrada.
person.identification=La identificaci\u00f3n es requerida.
person.identification_exist=Esta identificaci\u00f3n ya se encuentra registrada.
person.name=El nombre es requerido.
person.last_name=El apellido es requerido.
person.gender=El genero es requerido.
person.birthday=La fecha de nacimiento es requerida.

email.is_null=La informaci\u00f3n del correo electr\u00f3nico es requerida.
email.address_required=La direcci\u00f3n de correo electr\u00f3nico es requerida.
email.address_valid=La siguiente direcci\u00f3n de correo electr\u00f3nico %s no es valida.
email.a_exists=La siguiente direcci\u00f3n de correo electr\u00f3nico %s ya existe.
email.index_required=El indice del email es requerido y debe ser mayor a cero.
email.not_found=El correo electr\u00f3nico perteneciente a la persona con id %d e indice %d no fue encontrado.
email.address_null=Uno de los correos electr\u00f3nicos tiene una direcci\u00f3n.

address.owner_id_required=El id del due\u00f1o de la direcci\u00f3n es requerida y debe ser mayor a cero. 
address.is_null=La informaci\u00f3n de la direcci\u00f3n es requerida.
address.tag_required=La etiqueta de la direcci\u00f3n(tag) es requerida.
address.resid_address_required=La direcci\u00f3n residencial (residential address) es requerida.
address.neighborhood_required=El nombre del barrio en el cual esta ubicado la direcci\u00f3n es requerido.
address.id_required=El id de la direcci\u00f3n es requerido y debe ser mayor a cero.
address.not_found=La direcci\u00f3n perteneciente al due\u00f1o con id %d e id de direcci\u00f3n %d no fue encontrado.
address.neighborhood_null=Una de las direcciones tiene la propiedad neighborhood vac\u00eda.
address.neighborhood_not_found=El barrio con id %d no fue encontrado.
address.resid_address_null=Una de las direcciones tiene la propiedad residentialAddress vac\u00eda.
address.tag_null=Una de las direcciones tiene la propiedad tag vac\u00eda.
addres.at_least=Al menos una direcci\u00f3n debe ser agregada.

phone.is_null=La informaci\u00f3n del tel\u00e9fono es requerida.
phone.tag_required=La etiqueta del t\u00e9lefono(tag) es requerida.
phone.number_required=El numero del tel\u00e9fono es requerido.
phone.is_valid=El siguiente numero de tel\u00e9fono %s no es valido.
phone.n_exists=El siguiente numero de tel\u00e9fono %s ya existe.
phone.index_required=El \u00edndice del tel\u00e9fono es requerido y debe ser mayor a cero.
phone.not_found=El tel\u00e9fono perteneciente a la persona con id %d e indice %d no fue encontrado.
phone.number_null=Alguno de los tel\u00e9fonos tiene un n\u00famero vac\u00edo.
phone.at_least=Al menos un tel\u00e9fono debe ser agregado.

pagination.start=El parametro start debe ser mayor a cero.
pagination.size=El parametro size debe ser mayor a cero.

organization.is_null=La informaci\u00f3n de organizaci\u00f3n es requerida.
organization.name_required=El nombre es requerido
organization.id_required=El id de la organizaci\u00f3n es requerida y debe ser mayor que 0.
organization.not_found=La organizaci\u00f3n con id %d no ha sido encontrado.
organization.nit=El NIT de la organizaci\u00f3n es requerido.
organization.nit_used=El NIT de la roganizaci\u00f3n %s a sido registrado.